clear
t = 0:0.1:0.5; # время
x = 0:0.6:3; # иксы
h = 0.6; #шаг по времени
tau = 0.1;# шаг по иксам
n = 5;# число разбиений
p = @(x) x^2-5.9*x+0.1;# функция фи(х)
phi = [];#нулевой временной слой
for k=1:(n+1)
  phi = [phi; p(x(k))];
endfor
f = @(x,t) ((-x-2)*t+(0.1*x)/(1+t^2)+0.2);
fxt= [];# таблица значений функции f(x, t)
fi = [];
for i = 1:(n+1)
  for j = 1:(n+1)
    fi = [fi; f(x(i), t(j))];
  endfor
  fxt = [fxt fi];
  fi = [];
endfor

c1 = tau/h^2;
c2 = 1-(2*tau)/h^2;

g1 = @(t) 0.2*t+0.1;
g2 = @(t) 0.1*atan(t)+0.1;

# матрица значиений функции u(x, t)
u = [
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0]];

# заполняю нулевой временной слой
for i = 1:(n+1)
  u(i, 1) = phi(i);
endfor

# заполняю значения при х = 0
for j = 2:(n+1)
  # 1 КУ
  u(1, j) = g1(t(j));
endfor

for j = 1:(n)
  for i = 2:(n)
    # из исходного уравнения
    u(i, j+1) = c1*u(i-1, j)+c2*u(i,j)+c1*u(i+1, j)+tau*fxt(i, j);
  endfor
  # 2 КУ
  u(6, j+1) = h*g2(t(j+1)) + u(5, j+1);
endfor

u
