clear
# задача сведена к задаче с однородными краевыми условиями и решена
alpha = @(t) 0.1*atan(t)+0.1;
beta = @(t) 0.2*t + 0.1;
t = 0:0.1:0.5;
x = 0:0.6:3;
K = 6;
n = 5;
muk = (pi/6):(2*pi/6):(pi*K/3);# мю к-ые
lmk = []; # ламбда к-ые
phik = []; # фи к-ые
Ak = []; # коэффициент А(мю к-ого)
# считаю коэффициенты
for i = 1:K
  lmk = [lmk; muk(i)^2];
  phik = [phik; -(4/(3*muk(i)^3))];
  Ak = [Ak; -(4/(3*muk(i))-2*sin(3*muk(i))/(3*muk(i)^2))];
endfor

# матрица значений y(x, t)
y = [
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0]];

# матрица значений u(x, t)
u = [
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0],
[0, 0, 0, 0, 0, 0]];

# заполняю матрицу y(x, t)
for j = 1:(n+1)
  for i = 1:(n+1)
    for k = 1:K
      y(i, j) = y(i,j)+sin(muk(k)*x(i))*(phik(k)*exp(-lmk(k)*t(j))+(Ak(k)/lmk(k))*t(j));
    endfor
  endfor
endfor

# заполняю матрицу u(x, t)
for j = 1:(n+1)
  for i = 1:(n+1)
    u(i, j) = y(i, j) + alpha(t(j))*x(i) + beta(t(j));
  endfor
endfor

u
