clear
t = 0:0.1:0.5; # время
x = 0:0.6:3; # иксы
h = 0.6; #шаг по времени
tau = 0.1;# шаг по иксам
n = 5;# число разбиений
p = @(x) x^2-5.9*x+0.1;# функция фи(х)
phi = [];#нулевой временной слой
for k=1:(n+1)
  phi = [phi; p(x(k))];
endfor
f = @(x,t) ((-x-2)*t+(0.1*x)/(1+t^2)+0.2);
fxt= [];# таблица значений функции f(x, t)
fi = [];
for i = 1:(n+1)
  for j = 1:(n+1)
    fi = [fi; f(x(i), t(j))];
  endfor
  fxt = [fxt fi];
  fi = [];
endfor

d = -2-h^2/tau;

A = [
[1,0,0,0,0,0],
[1,d,1,0,0,0],
[0,1,d,1,0,0],
[0,0,1,d,1,0],
[0,0,0,1,d,1],
[0,0,0,0,-1,1],
];

g1 = @(t) 0.2*t+0.1;
g2 = @(t) 0.1*atan(t)+0.1;

F0 = [];
F5 = [];

for j = 1:(n+1)
  F0= [F0; g1(t(j))];
  F5 = [F5; h*g2(t(j))];
endfor
#по временным слоям
F141 = [];
F142 = [];
F143 = [];
F144 = [];
F145 = [];

for i = 2:n
  F141 = [F141; ((-h^2/tau)*phi(i)-h^2*fxt(i,2))];
endfor
F141 = [F0(2); F141 ; F5(2)];
u1 = A\F141;# первый временной слой

for i = 2:n
  F142 = [F142; ((-h^2/tau)*u1(i)-h^2*fxt(i,3))];
endfor
F142 = [F0(3); F142 ; F5(3)];
u2 = A\F142;# второй временной слой

for i = 2:n
  F143 = [F143; ((-h^2/tau)*u2(i)-h^2*fxt(i,4))];
endfor
F143 = [F0(4); F143 ; F5(4)];
u3 = A\F143;# третий временной слой

for i = 2:n
  F144 = [F144; ((-h^2/tau)*u3(i)-h^2*fxt(i,5))];
endfor
F144 = [F0(5); F144 ; F5(5)];
u4 = A\F144;# четвертый временной слой

for i = 2:n
  F145 = [F145; ((-h^2/tau)*u4(i)-h^2*fxt(i,6))];
endfor
F145 = [F0(6); F145 ; F5(6)];
u5 = A\F145;# пятый временной слой

u = [phi u1 u2 u3 u4 u5];

u
